{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["sequential_1", 1, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv1", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv1", "strides": [2, 2], "kernel_regularizer": null, "padding": "same", "filters": 64, "kernel_size": [7, 7], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_conv1", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn_conv1", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "pool_size": [3, 3]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2a_branch2a", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 64, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2a_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2a_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 64, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2a_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2a_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 256, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch1", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2a_branch1", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 256, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch2c", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2a_branch2c", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch1", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2a_branch1", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2b_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2b_branch2a", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 64, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2b_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2b_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2b_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2b_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 64, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2b_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2b_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2b_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2b_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 256, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2b_branch2c", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2b_branch2c", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2c_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2c_branch2a", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 64, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2c_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2c_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2c_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2c_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 64, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2c_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2c_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2c_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res2c_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 256, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2c_branch2c", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn2c_branch2c", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3a_branch2a", "strides": [2, 2], "kernel_regularizer": null, "padding": "valid", "filters": 128, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3a_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3a_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3a_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3a_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 512, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch1", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3a_branch1", "strides": [2, 2], "kernel_regularizer": null, "padding": "valid", "filters": 512, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch2c", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3a_branch2c", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch1", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3a_branch1", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3b_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3b_branch2a", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 128, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3b_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3b_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3b_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3b_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3b_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3b_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3b_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3b_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 512, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3b_branch2c", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3b_branch2c", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3c_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3c_branch2a", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 128, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3c_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3c_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3c_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3c_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3c_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3c_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3c_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3c_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 512, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3c_branch2c", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3c_branch2c", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3d_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3d_branch2a", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 128, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3d_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3d_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3d_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3d_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3d_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3d_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_21", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3d_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res3d_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 512, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3d_branch2c", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn3d_branch2c", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_22", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4a_branch2a", "strides": [2, 2], "kernel_regularizer": null, "padding": "valid", "filters": 256, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn4a_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_23", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4a_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 256, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn4a_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_24", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4a_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 1024, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch1", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4a_branch1", "strides": [2, 2], "kernel_regularizer": null, "padding": "valid", "filters": 1024, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch2c", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn4a_branch2c", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch1", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn4a_branch1", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_25", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4b_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4b_branch2a", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 256, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4b_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn4b_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_26", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4b_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4b_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 256, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4b_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn4b_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_27", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4b_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4b_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 1024, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4b_branch2c", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn4b_branch2c", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_28", "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4c_branch2a", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4c_branch2a", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 256, "kernel_size": [1, 1], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4c_branch2a", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn4c_branch2a", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_29", "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4c_branch2b", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4c_branch2b", "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "filters": 256, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4c_branch2b", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null, "name": "bn4c_branch2b", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_30", "config": {"name": "activation_30", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4c_branch2c", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "res4c_branch2c", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "filters": 1024, 